app/controllers/definitions_controller.rb

  def index
    @definitions = Definition.all
---
SELECT "definitions".* FROM "definitions"

  def edit
    @definition = Definition.find(params[:id])
---
SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = $1 LIMIT 1  [["id", "793"]]

  def create
    @definition = Definition.new(definition_params)

    respond_to do |format|
      if @definition.save
---
INSERT INTO "definitions" ("created_at", "def", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 13 Aug 2014 14:40:18 UTC +00:00], ["def", "A bunch of crooks"], ["name", "Hargreaves Lansdown"], ["updated_at", Wed, 13 Aug 2014 14:40:18 UTC +00:00]]

  def destroy
    @definition.destroy
---
DELETE FROM "definitions" WHERE "definitions"."id" = $1  [["id", 1]]

    def set_definition
      @definition = Definition.find(params[:id])
---
SELECT "definitions".* FROM "definitions" WHERE "definitions"."id" = $1 LIMIT 1  [["id", "788"]]