app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 3
---
  def latest
    if signed_in? && current_user.admin?
      @posts = Post.all
      render 'index'
    else
      @posts = Post.all.order('created_at DESC').limit(3)

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", ""], ["created_at", Wed, 23 Jul 2014 08:48:37 UTC +00:00], ["title", ""], ["updated_at", Wed, 23 Jul 2014 08:48:37 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save